EMPTY_LABEL=

# Exception Code Labels
INVALID_END_POINT=\u0AA8\u0AC0\u0A9A\u0AC7\u0AA8\u0ABE {0} \u0A8F\u0AA8\u0ACD\u0AA1 \u0AAA\u0ACB\u0A88\u0AA8\u0ACD\u0A9F \u0A89\u0AAA\u0AB2\u0AAC\u0ACD\u0AA7 \u0AA8\u0AA5\u0AC0. \u0A95\u0AC3\u0AAA\u0ABE \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 allEndPoint \u0A95\u0ACB\u0AB2 \u0AA6\u0ACD\u0AB5\u0ABE\u0AB0\u0ABE \u0A8F\u0AA8\u0ACD\u0AA1 \u0AAA\u0ACB\u0A88\u0AA8\u0ACD\u0A9F \u0AA8\u0ABE\u0AAE \u0A9A\u0A95\u0ABE\u0AB8\u0AC0\u0AA8\u0AC7 \u0AAB\u0AB0\u0AC0 \u0AAA\u0ACD\u0AB0\u0AAF\u0ABE\u0AB8 \u0A95\u0AB0\u0ACB.
INVALID_LEVEL=\u0AA8\u0AC0\u0A9A\u0AC7\u0AA8\u0ABE {0} \u0AB2\u0AC7\u0AB5\u0AB2 \u0A8F\u0A95 \u0AAE\u0ABE\u0AA8\u0ACD\u0AAF \u0AB8\u0ACD\u0AA4\u0AB0 \u0AA8\u0AA5\u0AC0. \u0A95\u0AC3\u0AAA\u0ABE \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 allEndPoint \u0A95\u0ACB\u0AB2 \u0AA6\u0ACD\u0AB5\u0ABE\u0AB0\u0ABE \u0AB8\u0AAA\u0ACB\u0AB0\u0ACD\u0A9F\u0AC7\u0AA1 \u0AB2\u0AC7\u0AB5\u0AB2 \u0A85\u0AA8\u0AC7 \u0A8F\u0AA8\u0ACD\u0AA1 \u0AAA\u0ACB\u0A88\u0AA8\u0ACD\u0A9F \u0A9A\u0A95\u0ABE\u0AB8\u0AC0\u0AA8\u0AC7 \u0AAB\u0AB0\u0AC0 \u0AAA\u0ACD\u0AB0\u0AAF\u0ABE\u0AB8 \u0A95\u0AB0\u0ACB.
UNAVAILABLE_LEVEL=\u0AA8\u0AC0\u0A9A\u0AC7\u0AA8\u0ABE {0} \u0AB2\u0AC7\u0AB5\u0AB2 {1} \u0A8F\u0AA8\u0ACD\u0AA1 \u0AAA\u0ACB\u0A88\u0AA8\u0ACD\u0A9F \u0AAA\u0AB0 \u0A89\u0AAA\u0AB2\u0AAC\u0ACD\u0AA7 \u0AA8\u0AA5\u0AC0. \u0A95\u0AC3\u0AAA\u0ABE \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 \u0AB8\u0AAA\u0ACB\u0AB0\u0ACD\u0A9F\u0AC7\u0AA1 \u0AB2\u0AC7\u0AB5\u0AB2 \u0A85\u0AA8\u0AC7 \u0A8F\u0AA8\u0ACD\u0AA1 \u0AAA\u0ACB\u0A88\u0AA8\u0ACD\u0A9F \u0A9A\u0A95\u0ABE\u0AB8\u0ACB \u0A85\u0AA8\u0AC7 \u0AAB\u0AB0\u0AC0 \u0AAA\u0ACD\u0AB0\u0AAF\u0ABE\u0AB8 \u0A95\u0AB0\u0ACB.
INVALID_ACCESS=\u0AA8\u0AC0\u0A9A\u0AC7\u0AA8\u0AC0 {0} \u0AAE\u0AC7\u0AA5\u0AA1 \u0A8F\u0A95\u0ACD\u0AB8\u0AC7\u0AB8 \u0A95\u0AB0\u0AC0 \u0AB6\u0A95\u0ABE\u0AA4\u0AC0 \u0AA8\u0AA5\u0AC0. \u0A86 \u0A85\u0AAF\u0ACB\u0A97\u0ACD\u0AAF \u0AB5\u0ABF\u0A9D\u0ABF\u0AAC\u0ABF\u0AB2\u0ABF\u0A9F\u0AC0 \u0A85\u0AA5\u0AB5\u0ABE \u0A85\u0AAF\u0ACB\u0A97\u0ACD\u0AAF \u0AAE\u0AC7\u0AA5\u0AA1 \u0AB5\u0ACD\u0AAF\u0ABE\u0A96\u0ACD\u0AAF\u0ABE\u0AA8\u0AC7 \u0A95\u0ABE\u0AB0\u0AA3\u0AC7 \u0AB9\u0ACB\u0A88 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7. \u0A95\u0AC3\u0AAA\u0ABE \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 \u0AB2\u0ACB\u0A97 \u0AA4\u0AAA\u0ABE\u0AB8\u0ACB.
INVALID_AGRUMENTS=\u0AA8\u0AC0\u0A9A\u0AC7\u0AA8\u0AC0 {0} \u0AAE\u0AC7\u0AA5\u0AA1\u0AAE\u0ABE\u0A82 \u0AB8\u0ABE\u0A9A\u0ABE \u0A86\u0AB0\u0ACD\u0A97\u0ACD\u0AAF\u0AC1\u0AAE\u0AC7\u0AA8\u0ACD\u0A9F\u0ACD\u0AB8 \u0AAA\u0ABE\u0AB8 \u0A95\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0ACD\u0AAF\u0ABE \u0AA8\u0AA5\u0AC0. \u0A95\u0AC3\u0AAA\u0ABE \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 \u0AB2\u0ACB\u0A97 \u0AA4\u0AAA\u0ABE\u0AB8\u0ACB.
SYSTEM_ERROR=\u0AB8\u0ABF\u0AB8\u0ACD\u0A9F\u0AAE\u0AAE\u0ABE\u0A82 \u0AAD\u0AC2\u0AB2 \u0A86\u0AB5\u0AC0 \u0A9B\u0AC7. \u0A95\u0AC3\u0AAA\u0ABE \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 \u0AB2\u0ACB\u0A97 \u0AA4\u0AAA\u0ABE\u0AB8\u0ACB.

# XSS based Injections
XSS_VULNERABILITY=\u0A95\u0ACD\u0AB0\u0ACB\u0AB8-\u0AB8\u0ABE\u0A87\u0A9F \u0AB8\u0ACD\u0A95\u0ACD\u0AB0\u0ABF\u0AAA\u0ACD\u0A9F\u0AC0\u0A82\u0A97 (XSS) \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE \u0A8F \u0A8F\u0A95 \u0AAA\u0ACD\u0AB0\u0A95\u0ABE\u0AB0\u0AA8\u0AC1\u0A82 \u0A88\u0AA8\u0ACD\u0A9C\u0AC7\u0A95\u0ACD\u0AB6\u0AA8 \u0A9B\u0AC7, \u0A9C\u0AC7\u0AAE\u0ABE\u0A82 \u0AA8\u0AC1\u0A95\u0AB8\u0ABE\u0AA8\u0A95\u0ABE\u0AB0\u0A95 \u0AB8\u0ACD\u0A95\u0ACD\u0AB0\u0ABF\u0AAA\u0ACD\u0A9F\u0ACD\u0AB8\u0AA8\u0AC7 \
\u0AB5\u0ABF\u0AB6\u0ACD\u0AB5\u0ABE\u0AB8\u0AAA\u0ABE\u0AA4\u0ACD\u0AB0 \u0AB5\u0AC7\u0AAC\u0AB8\u0ABE\u0A87\u0A9F\u0ACD\u0AB8\u0AAE\u0ABE\u0A82 \u0A87\u0AA8\u0ACD\u0A9C\u0AC7\u0A95\u0ACD\u0A9F \u0A95\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7. XSS \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE \u0AA4\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0AA5\u0ABE\u0AAF \u0A9B\u0AC7 \u0A9C\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0A95\u0ACB\u0A88 \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0A96\u0ACB\u0AB0 \u0AB5\u0AC7\u0AAC \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8\u0AA8\u0ACB \u0A89\u0AAA\u0AAF\u0ACB\u0A97 \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 \u0A85\u0AA8\u0ACD\u0AAF \u0AB5\u0AAA\u0AB0\u0ABE\u0AB6\u0A95\u0AB0\u0ACD\u0AA4\u0ABE\u0AA8\u0AC7 \
\u0AAC\u0ACD\u0AB0\u0ABE\u0A89\u0A9D\u0AB0 \u0AB8\u0ABE\u0A87\u0AA1 \u0AB8\u0ACD\u0A95\u0ACD\u0AB0\u0ABF\u0AAA\u0ACD\u0A9F\u0AA8\u0ABE \u0AB0\u0AC2\u0AAA\u0AAE\u0ABE\u0A82 \u0AA6\u0AC2\u0AB7\u0ABF\u0AA4 \u0A95\u0ACB\u0AA1 \u0AAE\u0ACB\u0A95\u0AB2\u0AC7 \u0A9B\u0AC7. \u0A86 \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0A93\u0AA8\u0AC7 \u0AB8\u0AAB\u0AB3 \u0AAC\u0AA8\u0ABE\u0AB5\u0AA4\u0AC0 \u0A96\u0ABE\u0AAE\u0AC0\u0A93 \u0A96\u0AC2\u0AAC \u0A9C \u0AB5\u0ACD\u0AAF\u0ABE\u0AAA\u0A95 \u0A9B\u0AC7 \u0A85\u0AA8\u0AC7 \u0AA4\u0AC7 \u0AA4\u0ACD\u0AAF\u0ABE\u0A82 \u0A9C\u0ACB\u0AB5\u0ABE \u0AAE\u0AB3\u0AC7 \u0A9B\u0AC7 \u0A9C\u0ACD\u0AAF\u0ABE\u0A82 \u0AB5\u0AC7\u0AAC \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8 \
\u0AB5\u0AAA\u0AB0\u0ABE\u0AB6\u0A95\u0AB0\u0ACD\u0AA4\u0ABE \u0AAA\u0ABE\u0AB8\u0AC7\u0AA5\u0AC0 \u0AB2\u0AC0\u0AA7\u0AC7\u0AB2\u0ABE \u0A87\u0AA8\u0AAA\u0AC1\u0A9F\u0AA8\u0AC7 \u0AB5\u0AC7\u0AB2\u0ABF\u0AA1\u0AC7\u0A9F \u0A85\u0AA5\u0AB5\u0ABE \u0A8F\u0AA8\u0ACD\u0A95\u0ACB\u0AA1 \u0A95\u0AB0\u0ACD\u0AAF\u0ABE \u0AB5\u0A97\u0AB0 \u0A86\u0A89\u0A9F\u0AAA\u0AC1\u0A9F\u0AAE\u0ABE\u0A82 \u0AB8\u0AC0\u0AA7\u0AC1\u0A82 \u0A9C \u0AB5\u0ABE\u0AAA\u0AB0\u0AC7 \u0A9B\u0AC7. <br/> <br/> \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0A96\u0ACB\u0AB0 \u0A95\u0ACB\u0A88 \u0A85\u0A9C\u0ABE\u0AA3\u0ACD\u0AAF\u0ABE \u0AB5\u0AAA\u0AB0\u0ABE\u0AB6\u0A95\u0AB0\u0ACD\u0AA4\u0ABE\u0AA8\u0AC7 \u0AA6\u0AC2\u0AB7\u0ABF\u0AA4 \u0AB8\u0ACD\u0A95\u0ACD\u0AB0\u0ABF\u0AAA\u0ACD\u0A9F \u0AAE\u0ACB\u0A95\u0AB2\u0AB5\u0ABE \u0AAE\u0ABE\u0A9F\u0AC7 XSS \u0AA8\u0ACB \u0A89\u0AAA\u0AAF\u0ACB\u0A97 \u0A95\u0AB0\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7. \
\u0AB5\u0AAA\u0AB0\u0ABE\u0AB6\u0A95\u0AB0\u0ACD\u0AA4\u0ABE\u0AA8\u0ABE \u0AAC\u0ACD\u0AB0\u0ABE\u0A89\u0A9D\u0AB0 \u0AAA\u0ABE\u0AB8\u0AC7 \u0A8F \u0A9C\u0ABE\u0AA3\u0AB5\u0ABE\u0AA8\u0AC0 \u0A95\u0ACB\u0A88 \u0AB0\u0AC0\u0AA4 \u0AA8\u0AA5\u0AC0 \u0A95\u0AC7 \u0AB8\u0ACD\u0A95\u0ACD\u0AB0\u0ABF\u0AAA\u0ACD\u0A9F \u0AB5\u0ABF\u0AB6\u0ACD\u0AB5\u0ABE\u0AB8\u0AAA\u0ABE\u0AA4\u0ACD\u0AB0 \u0AA8\u0AA5\u0AC0, \u0A85\u0AA8\u0AC7 \u0AA4\u0AC7 \u0AB8\u0ACD\u0A95\u0ACD\u0AB0\u0ABF\u0AAA\u0ACD\u0A9F\u0AA8\u0AC7 \u0A8F\u0A95\u0ACD\u0A9D\u0ABF\u0A95\u0ACD\u0AAF\u0AC1\u0A9F \u0A95\u0AB0\u0AB6\u0AC7. \
\u0AA4\u0AC7 \u0AB5\u0ABF\u0A9A\u0ABE\u0AB0\u0AC7 \u0A9B\u0AC7 \u0A95\u0AC7 \u0AB8\u0ACD\u0A95\u0ACD\u0AB0\u0ABF\u0AAA\u0ACD\u0A9F \u0AB5\u0ABF\u0AB6\u0ACD\u0AB5\u0ABE\u0AB8\u0AAA\u0ABE\u0AA4\u0ACD\u0AB0 \u0AB8\u0ACD\u0AA4\u0ACD\u0AB0\u0ACB\u0AA4\u0AAE\u0ABE\u0A82\u0AA5\u0AC0 \u0A86\u0AB5\u0AC0 \u0A9B\u0AC7, \u0AA4\u0AC7\u0AA5\u0AC0 \u0AA6\u0AC2\u0AB7\u0ABF\u0AA4 \u0AB8\u0ACD\u0A95\u0ACD\u0AB0\u0ABF\u0AAA\u0ACD\u0A9F \u0AAC\u0ACD\u0AB0\u0ABE\u0A89\u0A9D\u0AB0 \u0AAA\u0ABE\u0AB8\u0AC7 \u0AB0\u0AB9\u0AC7\u0AB2\u0AC0 \u0A95\u0ACB\u0A88\u0AAA\u0AA3 \u0A95\u0AC2\u0A95\u0AC0\u0A9D, \u0AB8\u0AC7\u0AB6\u0AA8 \u0A9F\u0ACB\u0A95\u0AA8\u0ACD\u0AB8, \
\u0A85\u0AA5\u0AB5\u0ABE \u0A85\u0AA8\u0ACD\u0AAF \u0AB8\u0A82\u0AB5\u0AC7\u0AA6\u0AA8\u0AB6\u0AC0\u0AB2 \u0AAE\u0ABE\u0AB9\u0ABF\u0AA4\u0AC0 \u0AAE\u0AC7\u0AB3\u0AB5\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7. \u0A86 \u0AB8\u0ACD\u0A95\u0ACD\u0AB0\u0ABF\u0AAA\u0ACD\u0A9F\u0ACD\u0AB8 HTML \u0AAA\u0AC7\u0A9C\u0AA8\u0AC0 \u0AB8\u0ABE\u0AAE\u0A97\u0ACD\u0AB0\u0AC0\u0AA8\u0AC7 \u0AAA\u0AA3 \u0AAC\u0AA6\u0AB2\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7. <br/><br/> XSS \u0AB5\u0ABF\u0AB6\u0AC7 \u0AB5\u0AA7\u0AC1 \u0AAE\u0ABE\u0AB9\u0ABF\u0AA4\u0AC0 \u0AAE\u0ABE\u0A9F\u0AC7: <ol><li><a href="https://owasp.org/www-community/attacks/xss/" target="_blank">Owasp XSS</a> \
<li><a href="https://www.google.com/about/appsecurity/learning/xss/" target="_blank">Google Application Security</a></ol>

#### AttackVector description
PERSISTENT_XSS_HTML_TAG_URL_PARAM_DIRECTLY_INJECTED_IN_DIV_TAG=\"comment\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"div\" \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
PERSISTENT_XSS_HTML_TAG_URL_PARAM_DIRECTLY_INJECTED_IN_DIV_TAG_REPLACING_IMG_AND_INPUT_TAG=\"comment\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \"<img\" \u0A85\u0AA8\u0AC7 \"<input\" \u0A9F\u0AC7\u0A97\u0ACD\u0AB8 \u0AAC\u0AA6\u0AB2\u0ACD\u0AAF\u0ABE \u0AAA\u0A9B\u0AC0 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"div\" \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
PERSISTENT_XSS_HTML_TAG_URL_PARAM_DIRECTLY_INJECTED_IN_DIV_TAG_REPLACING_IMG_AND_INPUT_TAG_CASE_INSENSITIVE=\"comment\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0A95\u0AC7\u0AB8-\u0A87\u0AA8\u0ACD\u0AB8\u0AC7\u0AA8\u0ACD\u0AB8\u0ABF\u0A9F\u0ABF\u0AB5 \"<img\" \u0A85\u0AA8\u0AC7 \"<input\" \u0A9F\u0AC7\u0A97\u0ACD\u0AB8 \u0AAC\u0AA6\u0AB2\u0ACD\u0AAF\u0ABE \u0AAA\u0A9B\u0AC0 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"div\" \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.

PERSISTENT_XSS_HTML_TAG_URL_PARAM_DIRECTLY_INJECTED_IN_DIV_TAG_REPLACING_IMG_AND_INPUT_TAG_IF_TAGS_ARE_PRESENT_BEFORE_NULL_BYTE=\u0A9C\u0ACB \u0AA8\u0AB2 \u0AAC\u0ABE\u0A88\u0A9F (Null Byte) \u0AAA\u0AB9\u0AC7\u0AB2\u0ABE\u0A82 \u0A9F\u0AC7\u0A97\u0ACD\u0AB8 \u0AB9\u0ABE\u0A9C\u0AB0 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \"<img\" \u0A85\u0AA8\u0AC7 \"<input\" \u0A9F\u0AC7\u0A97\u0ACD\u0AB8 \u0AAC\u0AA6\u0AB2\u0ACD\u0AAF\u0ABE \u0AAA\u0A9B\u0AC0 \"comment\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"div\" \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
PERSISTENT_XSS_HTML_TAG_URL_PARAM_DIRECTLY_INJECTED_IN_DIV_TAG_REPLACING_IMG_AND_INPUT_TAG_CASE_INSENSITIVEIF_TAGS_ARE_PRESENT_BEFORE_NULL_BYTE=\u0A9C\u0ACB \u0AA8\u0AB2 \u0AAC\u0ABE\u0A88\u0A9F (Null Byte) \u0AAA\u0AB9\u0AC7\u0AB2\u0ABE\u0A82 \u0A9F\u0AC7\u0A97\u0ACD\u0AB8 \u0AB9\u0ABE\u0A9C\u0AB0 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \u0A95\u0AC7\u0AB8-\u0A87\u0AA8\u0ACD\u0AB8\u0AC7\u0AA8\u0ACD\u0AB8\u0ABF\u0A9F\u0ABF\u0AB5 \"<img\" \u0A85\u0AA8\u0AC7 \"<input\" \u0A9F\u0AC7\u0A97\u0ACD\u0AB8 \u0AAC\u0AA6\u0AB2\u0ACD\u0AAF\u0ABE \u0AAA\u0A9B\u0AC0 \"comment\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"div\" \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
PERSISTENT_XSS_HTML_TAG_URL_PARAM_DIRECTLY_INJECTED_IN_DIV_TAG_AFTER_HTML_ESCAPING_POST_CONTENT_BEFORE_NULL_BYTE=\"comment\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AA8\u0AB2 \u0AAC\u0ABE\u0A88\u0A9F \u0AAA\u0AB9\u0AC7\u0AB2\u0ABE\u0A82\u0AA8\u0ABE \u0A95\u0AA8\u0ACD\u0A9F\u0AC7\u0AA8\u0ACD\u0A9F\u0AA8\u0AC7 HTML \u0A8F\u0AB8\u0ACD\u0A95\u0AC7\u0AAA \u0A95\u0AB0\u0ACD\u0AAF\u0ABE \u0AAA\u0A9B\u0AC0 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"div\" \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.


## Image Tag Injections
XSS_IMAGE_TAG_INJECTION=$XSS_VUL_VULNERABILITY <br\> \u0A86 \u0AA8\u0AAC\u0AB3\u0ABE\u0A88 \u0A87\u0AAE\u0AC7\u0A9C \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0AA5\u0AA4\u0ABE XSS \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0A93 \u0AB8\u0ABE\u0AA5\u0AC7 \u0AB8\u0A82\u0AAC\u0A82\u0AA7\u0ABF\u0AA4 \u0A9B\u0AC7.
#### Attack Vector Description
XSS_DIRECT_INPUT_SRC_ATTRIBUTE_IMG_TAG=URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0ACD\u0AB8 \u0A87\u0AAE\u0AC7\u0A9C \u0A9F\u0AC7\u0A97\u0AA8\u0ABE src \u0A8F\u0A9F\u0ACD\u0AB0\u0ABF\u0AAC\u0ACD\u0AAF\u0AC1\u0A9F\u0AAE\u0ABE\u0A82 \u0AB8\u0AC0\u0AA7\u0ABE \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
XSS_QUOTES_ON_INPUT_SRC_ATTRIBUTE_IMG_TAG=URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0ACD\u0AB8\u0AAE\u0ABE\u0A82 \u0A95\u0ACD\u0AB5\u0ACB\u0A9F\u0ACD\u0AB8 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7 \u0A85\u0AA8\u0AC7 \u0AAA\u0A9B\u0AC0 \u0A87\u0AAE\u0AC7\u0A9C \u0A9F\u0AC7\u0A97\u0AA8\u0ABE src \u0A8F\u0A9F\u0ACD\u0AB0\u0ABF\u0AAC\u0ACD\u0AAF\u0AC1\u0A9F\u0AAE\u0ABE\u0A82 \u0AB8\u0AC0\u0AA7\u0ABE \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
XSS_HTML_ESCAPE_ON_DIRECT_INPUT_SRC_ATTRIBUTE_IMG_TAG=URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0ACD\u0AB8 \u0AAA\u0AB0 HTML \u0A8F\u0AB8\u0ACD\u0A95\u0AC7\u0AAA\u0ABF\u0A82\u0A97 \u0A95\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7 \u0A85\u0AA8\u0AC7 \u0AAA\u0A9B\u0AC0 \u0A87\u0AAE\u0AC7\u0A9C \u0A9F\u0AC7\u0A97\u0AA8\u0ABE src \u0A8F\u0A9F\u0ACD\u0AB0\u0ABF\u0AAC\u0ACD\u0AAF\u0AC1\u0A9F\u0AAE\u0ABE\u0A82 \u0AB8\u0AC0\u0AA7\u0ABE \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
XSS_HTML_ESCAPE_ON_DIRECT_INPUT_AND_REMOVAL_OF_VALUES_WITH_PARENTHESIS_SRC_ATTRIBUTE_IMG_TAG=URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0ACD\u0AB8 \u0AAA\u0AB0 HTML \u0A8F\u0AB8\u0ACD\u0A95\u0AC7\u0AAA\u0ABF\u0A82\u0A97 \u0A85\u0AA8\u0AC7 \u0AAA\u0AC7\u0AB0\u0AC7\u0AA8\u0ACD\u0AA5\u0AC7\u0AB8\u0AC0\u0AB8 \u0AB5\u0ABE\u0AB3\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1\u0A9D \u0AA6\u0AC2\u0AB0 \u0A95\u0AB0\u0ACD\u0AAF\u0ABE \u0AAA\u0A9B\u0AC0 \u0A87\u0AAE\u0AC7\u0A9C \u0A9F\u0AC7\u0A97\u0AA8\u0ABE src \u0A8F\u0A9F\u0ACD\u0AB0\u0ABF\u0AAC\u0ACD\u0AAF\u0AC1\u0A9F\u0AAE\u0ABE\u0A82 \u0AB8\u0AC0\u0AA7\u0ABE \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
XSS_QUOTES_AND_WITH_HTML_ESCAPE_ON_INPUT_SRC_ATTRIBUTE_IMG_TAG=URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0ACD\u0AB8 \u0AAA\u0AB0 HTML \u0A8F\u0AB8\u0ACD\u0A95\u0AC7\u0AAA\u0ABF\u0A82\u0A97 \u0A95\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7 \u0A85\u0AA8\u0AC7 \u0AAA\u0A9B\u0AC0 \u0A87\u0AAE\u0AC7\u0A9C \u0A9F\u0AC7\u0A97\u0AA8\u0ABE src \u0A8F\u0A9F\u0ACD\u0AB0\u0ABF\u0AAC\u0ACD\u0AAF\u0AC1\u0A9F\u0AAE\u0ABE\u0A82 \u0A95\u0ACD\u0AB5\u0ACB\u0A9F\u0ACD\u0AB8\u0AA8\u0AC0 \u0A85\u0A82\u0AA6\u0AB0 \u0AAE\u0AC2\u0A95\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
XSS_HTML_ESCAPE_PLUS_FILTERING_ON_INPUT_SRC_ATTRIBUTE_IMG_TAG_BUT_NULL_BYTE_VULNERABLE=URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0ACD\u0AB8 HTML \u0A8F\u0AB8\u0ACD\u0A95\u0AC7\u0AAA \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 \u0AAB\u0ABE\u0A88\u0AB2\u0AA8\u0ABE\u0AAE\u0ACB\u0AA8\u0ABE \u0AB5\u0ACD\u0AB9\u0ABE\u0A87\u0A9F\u0AB2\u0ABF\u0AB8\u0ACD\u0A9F \u0AB8\u0ABE\u0AAE\u0AC7 \u0AB5\u0AC7\u0AB2\u0ABF\u0AA1\u0AC7\u0A9F \u0A95\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7, \u0A9C\u0ACB\u0A95\u0AC7 \u0AAB\u0ABE\u0A88\u0AB2\u0AA8\u0ABE\u0AAE \u0AB5\u0AC7\u0AB2\u0ABF\u0AA1\u0AC7\u0A9F\u0AB0 \u0AA8\u0AB2 \u0AAC\u0ABE\u0A88\u0A9F \u0A87\u0AA8\u0ACD\u0A9C\u0AC7\u0A95\u0ACD\u0AB6\u0AA8 \u0AAE\u0ABE\u0A9F\u0AC7 \u0AA8\u0AAC\u0AB3\u0AC1\u0A82 \u0A9B\u0AC7.
XSS_QUOTES_AND_WITH_HTML_ESCAPE_PLUS_FILTERING_ON_INPUT_SRC_ATTRIBUTE_IMG_TAG=URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0ACD\u0AB8 HTML \u0A8F\u0AB8\u0ACD\u0A95\u0AC7\u0AAA \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 \u0AAB\u0ABE\u0A88\u0AB2\u0AA8\u0ABE\u0AAE\u0ACB\u0AA8\u0ABE \u0AB5\u0ACD\u0AB9\u0ABE\u0A87\u0A9F\u0AB2\u0ABF\u0AB8\u0ACD\u0A9F \u0AB8\u0ABE\u0AAE\u0AC7 \u0AB5\u0AC7\u0AB2\u0ABF\u0AA1\u0AC7\u0A9F \u0A95\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7 \u0A85\u0AA8\u0AC7 \u0A87\u0AAE\u0AC7\u0A9C \u0A9F\u0AC7\u0A97\u0AA8\u0ABE src \u0A8F\u0A9F\u0ACD\u0AB0\u0ABF\u0AAC\u0ACD\u0AAF\u0AC1\u0A9F\u0AAE\u0ABE\u0A82 \u0A95\u0ACD\u0AB5\u0ACB\u0A9F\u0ACD\u0AB8\u0AA8\u0AC0 \u0A85\u0A82\u0AA6\u0AB0 \u0AAE\u0AC2\u0A95\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.

## Html Tag Injection
XSS_HTML_TAG_INJECTION=HTML \u0A9F\u0AC7\u0A97 \u0A86\u0AA7\u0ABE\u0AB0\u0ABF\u0AA4 XSS \u0AB9\u0AC1\u0AAE\u0AB2\u0ACB.
XSS_DIRECT_INPUT_DIV_TAG=HTML \u0A9F\u0AC7\u0A97 \u0AB8\u0AC0\u0AA7\u0AC0 \u0AB0\u0AC0\u0AA4\u0AC7 div \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A87\u0AA8\u0ACD\u0A9C\u0AC7\u0A95\u0ACD\u0A9F \u0A95\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.

### Attack vectors
XSS_DIRECT_INPUT_DIV_TAG=URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0ACD\u0AB8 \u0AB8\u0AC0\u0AA7\u0ABE div \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
XSS_DIRECT_INPUT_DIV_TAG_AFTER_REMOVING_VALUES_CONTAINING_ANCHOR_SCRIPT_AND_IMG_TAG=\u0A9C\u0ACB URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0ACD\u0AB8\u0AAE\u0ABE\u0A82 Script/Image \u0A85\u0AA8\u0AC7 Anchor \u0A9F\u0AC7\u0A97 \u0AA8 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \u0AA4\u0AC7 \u0AB8\u0AC0\u0AA7\u0ABE div \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
XSS_DIRECT_INPUT_DIV_TAG_AFTER_REMOVING_VALUES_CONTAINING_ANCHOR_SCRIPT_IMG_TAG_AND_ALERT_KEYWORD=\u0A9C\u0ACB URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0ACD\u0AB8\u0AAE\u0ABE\u0A82 Script/Image/Anchor \u0A9F\u0AC7\u0A97 \u0A85\u0AA8\u0AC7 Javascript \u0A85\u0AA5\u0AB5\u0ABE Alert \u0A95\u0AC0\u0AB5\u0AB0\u0ACD\u0AA1 \u0AA8 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \u0AA4\u0AC7 \u0AB8\u0AC0\u0AA7\u0ABE div \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.

# URL Redirection
## Location Header Injection
OPEN_REDIRECTION_VULNERABILITY_3XX_BASED=\u0A93\u0AAA\u0AA8 \u0AB0\u0AC0\u0AA1\u0ABE\u0AAF\u0AB0\u0AC7\u0A95\u0ACD\u0AB6\u0AA8 \u0AA8\u0AAC\u0AB3\u0ABE\u0A88\u0A93 \u0AA4\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0A89\u0AA6\u0ACD\u0AAD\u0AB5\u0AC7 \u0A9B\u0AC7 \u0A9C\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8 \u0AB0\u0AC0\u0AA1\u0ABE\u0AAF\u0AB0\u0AC7\u0A95\u0ACD\u0AB6\u0AA8\u0AA8\u0ABE \u0A9F\u0ABE\u0AB0\u0ACD\u0A97\u0AC7\u0A9F\u0AAE\u0ABE\u0A82 \u0AB5\u0AAA\u0AB0\u0ABE\u0AB6\u0A95\u0AB0\u0ACD\u0AA4\u0ABE \u0AA6\u0ACD\u0AB5\u0ABE\u0AB0\u0ABE \u0AA8\u0ABF\u0AAF\u0A82\u0AA4\u0ACD\u0AB0\u0ABF\u0AA4 \u0A95\u0AB0\u0AC0 \u0AB6\u0A95\u0ABE\u0AAF \u0AA4\u0AC7\u0AB5\u0ACB \u0AA1\u0AC7\u0A9F\u0ABE \u0A85\u0AB8\u0AC1\u0AB0\u0A95\u0ACD\u0AB7\u0ABF\u0AA4 \u0AB0\u0AC0\u0AA4\u0AC7 \u0AB5\u0ABE\u0AAA\u0AB0\u0AC7 \u0A9B\u0AC7.<br/> \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0A96\u0ACB\u0AB0 \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8\u0AAE\u0ABE\u0A82 \u0A8F\u0AB5\u0AC1\u0A82 URL \u0AAC\u0AA8\u0ABE\u0AB5\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7 \u0A9C\u0AC7 \u0A95\u0ACB\u0A88 \u0AAA\u0AA3 \u0AAC\u0ABE\u0AB9\u0ACD\u0AAF \u0AA1\u0ACB\u0AAE\u0AC7\u0AA8 \u0AAA\u0AB0 \u0AB0\u0AC0\u0AA1\u0ABE\u0AAF\u0AB0\u0AC7\u0A95\u0ACD\u0A9F \u0A95\u0AB0\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7. \u0A86 \u0AB5\u0AB0\u0ACD\u0AA4\u0AA8\u0AA8\u0ACB \u0A89\u0AAA\u0AAF\u0ACB\u0A97 \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8\u0AA8\u0ABE \u0AB5\u0AAA\u0AB0\u0ABE\u0AB6\u0A95\u0AB0\u0ACD\u0AA4\u0ABE\u0A93 \u0AB8\u0ABE\u0AAE\u0AC7 \u0AAB\u0ABF\u0AB6\u0ABF\u0A82\u0A97 \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE \u0A95\u0AB0\u0AB5\u0ABE \u0AAE\u0ABE\u0A9F\u0AC7 \u0AA5\u0A88 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7.<br/> \u0AB8\u0ABE\u0A9A\u0ABE \u0AA1\u0ACB\u0AAE\u0AC7\u0AA8 \u0A85\u0AA8\u0AC7 \u0AB5\u0AC7\u0AB2\u0ABF\u0AA1 SSL \u0AB8\u0AB0\u0ACD\u0A9F\u0ABF\u0AAB\u0ABF\u0A95\u0AC7\u0A9F \u0AB5\u0ABE\u0AB3\u0ABE URL \u0AA8\u0ACB \u0A89\u0AAA\u0AAF\u0ACB\u0A97 \u0AAB\u0ABF\u0AB6\u0ABF\u0A82\u0A97 \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0AA8\u0AC7 \u0AB5\u0AA7\u0AC1 \u0AB5\u0ABF\u0AB6\u0ACD\u0AB5\u0ABE\u0AB8\u0AAA\u0ABE\u0AA4\u0ACD\u0AB0 \u0AAC\u0AA8\u0ABE\u0AB5\u0AC7 \u0A9B\u0AC7. <br/><br/> <a href="https://www.w3.org/Protocols/rfc2616/rfc2616.html">RFC 2616</a> \u0AB5\u0ABF\u0AB5\u0ABF\u0AA7 3xx \u0AB8\u0ACD\u0A9F\u0AC7\u0A9F\u0AB8 \u0A95\u0ACB\u0AA1\u0ACD\u0AB8 \u0AB5\u0ACD\u0AAF\u0ABE\u0A96\u0ACD\u0AAF\u0ABE\u0AAF\u0ABF\u0AA4 \u0A95\u0AB0\u0AC7 \u0A9B\u0AC7 \u0A9C\u0AC7 \u0AAC\u0ACD\u0AB0\u0ABE\u0A89\u0A9D\u0AB0\u0AA8\u0AC7 \u0AA8\u0ABF\u0AB0\u0ACD\u0AA6\u0ABF\u0AB7\u0ACD\u0A9F \u0AB8\u0ACD\u0AA5\u0ABE\u0AA8 \u0AAA\u0AB0 \u0AB0\u0AC0\u0AA1\u0ABE\u0AAF\u0AB0\u0AC7\u0A95\u0ACD\u0A9F \u0A95\u0AB0\u0AC7 \u0A9B\u0AC7.

OPEN_REDIRECT_QUERY_PARAM_DIRECTLY_ADD_TO_LOCATION_HEADER=\"returnTo\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"Location\" \u0AB9\u0AC7\u0AA1\u0AB0\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
OPEN_REDIRECT_QUERY_PARAM_DIRECTLY_ADD_TO_LOCATION_HEADER_IF_NOT_HTTP_HTTPS_WWW_OR_DOMAIN_IS_SAME=\"returnTo\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0A9C\u0ACB \u0AA4\u0AC7 \"http\",\"www\" \u0A85\u0AA8\u0AC7 \"https\" \u0AA5\u0AC0 \u0AB6\u0AB0\u0AC2 \u0AA8 \u0AA5\u0AA4\u0AC0 \u0AB9\u0ACB\u0AAF \u0A85\u0AA5\u0AB5\u0ABE \u0AA1\u0ACB\u0AAE\u0AC7\u0AA8 \u0AB8\u0AAE\u0ABE\u0AA8 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"Location\" \u0AB9\u0AC7\u0AA1\u0AB0\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
OPEN_REDIRECT_QUERY_PARAM_DIRECTLY_ADD_TO_LOCATION_HEADER_IF_NOT_HTTP_HTTPS_WWW_//_OR_DOMAIN_IS_SAME=\"returnTo\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0A9C\u0ACB \u0AA4\u0AC7 \"http\",\"www\", \"https\" \u0A85\u0AA8\u0AC7 \"//\" \u0AA5\u0AC0 \u0AB6\u0AB0\u0AC2 \u0AA8 \u0AA5\u0AA4\u0AC0 \u0AB9\u0ACB\u0AAF \u0A85\u0AA5\u0AB5\u0ABE \u0AA1\u0ACB\u0AAE\u0AC7\u0AA8 \u0AB8\u0AAE\u0ABE\u0AA8 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"Location\" \u0AB9\u0AC7\u0AA1\u0AB0\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
OPEN_REDIRECT_QUERY_PARAM_DIRECTLY_ADD_TO_LOCATION_HEADER_IF_NOT_HTTP_WWW_HTTPS_//_NULL_BYTE_OR_DOMAIN_IS_SAME=\"returnTo\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0A9C\u0ACB \u0AA4\u0AC7 \"http\",\"www\", \"https\", \"//\" \u0A85\u0AA8\u0AC7 \u0AA8\u0AB2 \u0AAC\u0ABE\u0A88\u0A9F\u0AA5\u0AC0 \u0AB6\u0AB0\u0AC2 \u0AA8 \u0AA5\u0AA4\u0AC0 \u0AB9\u0ACB\u0AAF \u0A85\u0AA5\u0AB5\u0ABE \u0AA1\u0ACB\u0AAE\u0AC7\u0AA8 \u0AB8\u0AAE\u0ABE\u0AA8 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"Location\" \u0AB9\u0AC7\u0AA1\u0AB0\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
OPEN_REDIRECT_QUERY_PARAM_DIRECTLY_ADD_TO_LOCATION_HEADER_IF_NOT_HTTP_HTTPS_//_WWW_%_OR_DOMAIN_IS_SAME=\"returnTo\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0A9C\u0ACB \u0AA4\u0AC7 \"http\",\"www\", \"https\", \"//\" \u0A85\u0AA8\u0AC7 33 \u0AA5\u0AC0 \u0A93\u0A9B\u0AC0 \u0A86\u0AB8\u0ACD\u0A95\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AA7\u0AB0\u0ABE\u0AB5\u0AA4\u0ABE \u0A95\u0AC7\u0AB0\u0AC7\u0A95\u0ACD\u0A9F\u0AB0\u0AA5\u0AC0 \u0AB6\u0AB0\u0AC2 \u0AA8 \u0AA5\u0AA4\u0AC0 \u0AB9\u0ACB\u0AAF \u0A85\u0AA5\u0AB5\u0ABE \u0AA1\u0ACB\u0AAE\u0AC7\u0AA8 \u0AB8\u0AAE\u0ABE\u0AA8 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"Location\" \u0AB9\u0AC7\u0AA1\u0AB0\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
OPEN_REDIRECT_QUERY_PARAM_DIRECTLY_ADDED_TO_LOCATION_HEADER_BY_ADDING_DOMAIN_AS_PREFIX=\"returnTo\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8\u0AA8\u0ABE \u0AA1\u0ACB\u0AAE\u0AC7\u0AA8 \u0AA8\u0AC7\u0AAE\u0AA8\u0AC7 \u0AAA\u0ACD\u0AB0\u0AC0\u0AAB\u0ABF\u0A95\u0ACD\u0AB8 \u0AA4\u0AB0\u0AC0\u0A95\u0AC7 \u0A89\u0AAE\u0AC7\u0AB0\u0AC0\u0AA8\u0AC7 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A9C \"Location\" \u0AB9\u0AC7\u0AA1\u0AB0\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.

## Meta Tag based URL Redirection
OPEN_REDIRECTION_VULNERABILITY_META_TAG_BASED=HTML \u0AAE\u0AC7\u0A9F\u0ABE \u0A8F\u0AB2\u0ABF\u0AAE\u0AC7\u0AA8\u0ACD\u0A9F \u0A9C\u0AC7 \u0AAC\u0ACD\u0AB0\u0ABE\u0A89\u0A9D\u0AB0 \u0AA6\u0ACD\u0AB5\u0ABE\u0AB0\u0ABE \u0AAA\u0AC7\u0A9C \u0AB0\u0ABF\u0AAB\u0ACD\u0AB0\u0AC7\u0AB6 \u0AA5\u0ABE\u0AAF \u0AA4\u0AC7 \u0AAA\u0AB9\u0AC7\u0AB2\u0ABE\u0A82\u0AA8\u0ACB \u0AB8\u0AAE\u0AAF \u0AB8\u0AC7\u0A95\u0AA8\u0ACD\u0AA1\u0AAE\u0ABE\u0A82 \u0AB8\u0ACD\u0AAA\u0AB7\u0ACD\u0A9F \u0A95\u0AB0\u0AC7 \u0A9B\u0AC7. \u0AB5\u0AC8\u0A95\u0AB2\u0ACD\u0AAA\u0ABF\u0A95 URI \u0AAA\u0AC2\u0AB0\u0ACB \u0AAA\u0ABE\u0AA1\u0AB5\u0ABE\u0AA5\u0AC0 \u0A86 \u0A8F\u0AB2\u0ABF\u0AAE\u0AC7\u0AA8\u0ACD\u0A9F\u0AA8\u0ACB \u0A89\u0AAA\u0AAF\u0ACB\u0A97 \u0A9F\u0ABE\u0A88\u0AAE\u0ACD\u0AA1 URL \u0AB0\u0AC0\u0AA1\u0ABE\u0AAF\u0AB0\u0AC7\u0A95\u0ACD\u0A9F\u0AB0 \u0AA4\u0AB0\u0AC0\u0A95\u0AC7 \u0AA5\u0A88 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7. <br/><br/> \u0A89\u0AA6\u0ABE\u0AB9\u0AB0\u0AA3 \u0AA4\u0AB0\u0AC0\u0A95\u0AC7: <br/> &lt;meta http-equiv=&quot;refresh&quot; content=&quot;5;url=http://example.com&quot;&gt;

URL_REDIRECTION_META_TAG_BASED_INJECTION=\u0AAE\u0AC7\u0A9F\u0ABE \u0A9F\u0AC7\u0A97 \u0A86\u0AA7\u0ABE\u0AB0\u0ABF\u0AA4 URL \u0AB0\u0AC0\u0AA1\u0ABE\u0AAF\u0AB0\u0AC7\u0A95\u0ACD\u0AB6\u0AA8.
URL_REDIRECTION_URL_PARAMETER_INJECTION_INTO_META_TAG=URL \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0 \u0AB8\u0AC0\u0AA7\u0ACB \u0A9C \u0AAE\u0AC7\u0A9F\u0ABE \u0A9F\u0AC7\u0A97\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.

# UNRESTRICTED_FILE_UPLOAD_VULNERABILITY
UNRESTRICTED_FILE_UPLOAD_VULNERABILITY=\u0A85\u0AAA\u0AB2\u0ACB\u0AA1 \u0A95\u0AB0\u0AC7\u0AB2\u0AC0 \u0AAB\u0ABE\u0A88\u0AB2\u0ACB \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8 \u0AAE\u0ABE\u0A9F\u0AC7 \u0AAE\u0ACB\u0A9F\u0AC1\u0A82 \u0A9C\u0ACB\u0A96\u0AAE \u0AB9\u0ACB\u0A88 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7. \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0AA8\u0AC1\u0A82 \u0AAA\u0ACD\u0AB0\u0AA5\u0AAE \u0AAA\u0A97\u0AB2\u0AC1\u0A82 \u0AB8\u0ABF\u0AB8\u0ACD\u0A9F\u0AAE\u0AAE\u0ABE\u0A82 \u0A95\u0ACB\u0A88 \u0A95\u0ACB\u0AA1 \u0AAA\u0AB9\u0ACB\u0A82\u0A9A\u0ABE\u0AA1\u0AB5\u0ABE\u0AA8\u0AC1\u0A82 \u0AB9\u0ACB\u0AAF \u0A9B\u0AC7, \u0A85\u0AA8\u0AC7 \u0AAA\u0A9B\u0AC0 \u0AA4\u0AC7\u0AA8\u0AC7 \u0A8F\u0A95\u0ACD\u0A9D\u0ABF\u0A95\u0ACD\u0AAF\u0AC1\u0A9F \u0A95\u0AB0\u0AB5\u0ABE\u0AA8\u0AC0 \u0AB0\u0AC0\u0AA4 \u0AB6\u0ACB\u0AA7\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.\
<br/>\u0A85\u0AA8\u0ABF\u0AAF\u0A82\u0AA4\u0ACD\u0AB0\u0ABF\u0AA4 \u0AAB\u0ABE\u0A88\u0AB2 \u0A85\u0AAA\u0AB2\u0ACB\u0AA1\u0AA8\u0ABE \u0AAA\u0AB0\u0ABF\u0AA3\u0ABE\u0AAE\u0ACB\u0AAE\u0ABE\u0A82 \u0AB8\u0ABF\u0AB8\u0ACD\u0A9F\u0AAE \u0AAA\u0AB0 \u0AB8\u0A82\u0AAA\u0AC2\u0AB0\u0ACD\u0AA3 \u0A95\u0AAC\u0A9C\u0ACB, \u0AA1\u0AC7\u0A9F\u0ABE\u0AAC\u0AC7\u0A9D \u0A93\u0AB5\u0AB0\u0AB2\u0ACB\u0AA1, \u0A95\u0ACD\u0AB2\u0ABE\u0AAF\u0AA8\u0ACD\u0A9F-\u0AB8\u0ABE\u0A87\u0AA1 \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE \u0A85\u0AA5\u0AB5\u0ABE \u0AB5\u0AC7\u0AAC\u0AB8\u0ABE\u0A87\u0A9F\u0AAE\u0ABE\u0A82 \u0AAB\u0AC7\u0AB0\u0AAB\u0ABE\u0AB0 (Defacement) \u0AA8\u0ACB \u0AB8\u0AAE\u0ABE\u0AB5\u0AC7\u0AB6 \u0AA5\u0A88 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7.

#### Attack Vector Description
UNRESTRICTED_FILE_UPLOAD_UNCONTROLLED_RESOURCE_CONSUMPTION=\u0AAE\u0AB9\u0AA4\u0ACD\u0AA4\u0AAE \u0A85\u0AAA\u0AB2\u0ACB\u0AA1 \u0AAB\u0ABE\u0A88\u0AB2 \u0AB8\u0ABE\u0A88\u0A9D \u0AAE\u0AB0\u0ACD\u0AAF\u0ABE\u0AA6\u0ABF\u0AA4 \u0AA8\u0AA5\u0AC0.
UNRESTRICTED_FILE_UPLOAD_NO_VALIDATION_FILE_NAME=\u0A85\u0AAA\u0AB2\u0ACB\u0AA1 \u0A95\u0AB0\u0AC7\u0AB2\u0AC0 \u0AAB\u0ABE\u0A88\u0AB2\u0AA8\u0ABE \u0AA8\u0ABE\u0AAE \u0AAA\u0AB0 \u0A95\u0ACB\u0A88 \u0AB5\u0AC7\u0AB2\u0ABF\u0AA1\u0AC7\u0AB6\u0AA8 \u0AA8\u0AA5\u0AC0.
UNRESTRICTED_FILE_UPLOAD_IF_NOT_HTML_FILE_EXTENSION=.html \u0AB8\u0ABF\u0AB5\u0ABE\u0AAF\u0AA8\u0ABE \u0AA4\u0AAE\u0ABE\u0AAE \u0AAB\u0ABE\u0A88\u0AB2 \u0A8F\u0A95\u0ACD\u0AB8\u0A9F\u0AC7\u0AA8\u0ACD\u0AB6\u0AA8\u0AA8\u0AC0 \u0AAE\u0A82\u0A9C\u0AC2\u0AB0\u0AC0 \u0A9B\u0AC7.
UNRESTRICTED_FILE_UPLOAD_IF_NOT_HTML_NOT_HTM_FILE_EXTENSION=.html \u0A85\u0AA8\u0AC7 .htm \u0AB8\u0ABF\u0AB5\u0ABE\u0AAF\u0AA8\u0ABE \u0AA4\u0AAE\u0ABE\u0AAE \u0AAB\u0ABE\u0A88\u0AB2 \u0A8F\u0A95\u0ACD\u0AB8\u0A9F\u0AC7\u0AA8\u0ACD\u0AB6\u0AA8\u0AA8\u0AC0 \u0AAE\u0A82\u0A9C\u0AC2\u0AB0\u0AC0 \u0A9B\u0AC7.
UNRESTRICTED_FILE_UPLOAD_IF_NOT_HTML_NOT_HTM_FILE_EXTENSION_CASE_INSENSITIVE=\u0A95\u0AC7\u0AB8-\u0A87\u0AA8\u0ACD\u0AB8\u0AC7\u0AA8\u0ACD\u0AB8\u0ABF\u0A9F\u0ABF\u0AB5 .html \u0A85\u0AA8\u0AC7 .htm \u0AB8\u0ABF\u0AB5\u0ABE\u0AAF\u0AA8\u0ABE \u0AA4\u0AAE\u0ABE\u0AAE \u0AAB\u0ABE\u0A88\u0AB2 \u0A8F\u0A95\u0ACD\u0AB8\u0A9F\u0AC7\u0AA8\u0ACD\u0AB6\u0AA8\u0AA8\u0AC0 \u0AAE\u0A82\u0A9C\u0AC2\u0AB0\u0AC0 \u0A9B\u0AC7.
UNRESTRICTED_FILE_UPLOAD_IF_FILE_NAME_NOT_CONTAINS_.PNG_OR_.JPEG_CASE_INSENSITIVE=\u0AAB\u0ABE\u0A88\u0AB2\u0AA8\u0AC1\u0A82 \u0AA8\u0ABE\u0AAE \u0AAE\u0ABE\u0AA4\u0ACD\u0AB0 \u0AA4\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0A9C \u0AAE\u0ABE\u0AA8\u0ACD\u0AAF \u0A9B\u0AC7 \u0A9C\u0ACB \u0AA4\u0AC7\u0AAE\u0ABE\u0A82 \u0A95\u0AC7\u0AB8-\u0A87\u0AA8\u0ACD\u0AB8\u0AC7\u0AA8\u0ACD\u0AB8\u0ABF\u0A9F\u0ABF\u0AB5 .jpeg \u0A85\u0AA5\u0AB5\u0ABE .png \u0AB9\u0ACB\u0AAF.
UNRESTRICTED_FILE_UPLOAD_IF_FILE_NAME_NOT_ENDS_WITH_.PNG_OR_.JPEG_CASE_INSENSITIVE_AND_FILE_NAMES_CONSIDERED_BEFORE_NULL_BYTE=\u0AAB\u0ABE\u0A88\u0AB2\u0AA8\u0AC1\u0A82 \u0AA8\u0ABE\u0AAE \u0AAE\u0ABE\u0AA4\u0ACD\u0AB0 \u0AA4\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0A9C \u0AAE\u0ABE\u0AA8\u0ACD\u0AAF \u0A9B\u0AC7 \u0A9C\u0ACB \u0AA4\u0AC7 \u0A95\u0AC7\u0AB8-\u0A87\u0AA8\u0ACD\u0AB8\u0AC7\u0AA8\u0ACD\u0AB8\u0ABF\u0A9F\u0ABF\u0AB5 .jpeg \u0A95\u0AC7 .png \u0AA5\u0AC0 \u0AB8\u0AAE\u0ABE\u0AAA\u0ACD\u0AA4 \u0AA5\u0AA4\u0AC1\u0A82 \u0AB9\u0ACB\u0AAF \u0A85\u0AA8\u0AC7 \u0AA4\u0AC7 \u0AA8\u0AB2 \u0AAC\u0ABE\u0A88\u0A9F \u0AAA\u0AB9\u0AC7\u0AB2\u0ABE\u0A82 \u0AB9\u0ACB\u0AAF.
UNRESTRICTED_FILE_UPLOAD_IF_FILE_NAME_NOT_ENDS_WITH_.PNG_OR_.JPEG_CASE_INSENSITIVE=\u0AAB\u0ABE\u0A88\u0AB2\u0AA8\u0AC1\u0A82 \u0AA8\u0ABE\u0AAE \u0AAE\u0ABE\u0AA4\u0ACD\u0AB0 \u0AA4\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0A9C \u0AAE\u0ABE\u0AA8\u0ACD\u0AAF \u0A9B\u0AC7 \u0A9C\u0ACB \u0AA4\u0AC7 \u0A95\u0AC7\u0AB8-\u0A87\u0AA8\u0ACD\u0AB8\u0AC7\u0AA8\u0ACD\u0AB8\u0ABF\u0A9F\u0ABF\u0AB5 .jpeg \u0A85\u0AA5\u0AB5\u0ABE .png \u0AA5\u0AC0 \u0AB8\u0AAE\u0ABE\u0AAA\u0ACD\u0AA4 \u0AA5\u0AA4\u0AC1\u0A82 \u0AB9\u0ACB\u0AAF.

# XXE Vulnerability
XXE_VULNERABILITY=XML \u0A8F\u0A95\u0ACD\u0AB8\u0A9F\u0AB0\u0ACD\u0AA8\u0AB2 \u0A8F\u0AA8\u0ACD\u0A9F\u0ABF\u0A9F\u0AC0 (XXE) \u0AB9\u0AC1\u0AAE\u0AB2\u0ACB \u0A8F XML \u0A87\u0AA8\u0AAA\u0AC1\u0A9F \u0AAA\u0ABE\u0AB0\u0ACD\u0AB8 \u0A95\u0AB0\u0AA4\u0AC0 \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8 \u0AAA\u0AB0 \u0AA5\u0AA4\u0ACB \u0AB9\u0AC1\u0AAE\u0AB2\u0ACB \u0A9B\u0AC7. \u0A86 \u0AB9\u0AC1\u0AAE\u0AB2\u0ACB \u0AA4\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0AA5\u0ABE\u0AAF \u0A9B\u0AC7 \u0A9C\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0AA8\u0AAC\u0AB3\u0AC0 \u0AB0\u0AC0\u0AA4\u0AC7 \u0A95\u0AA8\u0ACD\u0AAB\u0ABF\u0A97\u0AB0 \u0AA5\u0AAF\u0AC7\u0AB2 XML \u0AAA\u0ABE\u0AB0\u0ACD\u0AB8\u0AB0 \u0A8F\u0A95\u0ACD\u0AB8\u0A9F\u0AB0\u0ACD\u0AA8\u0AB2 \u0A8F\u0AA8\u0ACD\u0A9F\u0ABF\u0A9F\u0AC0 \u0AA7\u0AB0\u0ABE\u0AB5\u0AA4\u0ABE XML \u0A87\u0AA8\u0AAA\u0AC1\u0A9F\u0AA8\u0AC7 \u0AAA\u0ACD\u0AB0\u0ACB\u0AB8\u0AC7\u0AB8 \u0A95\u0AB0\u0AC7 \u0A9B\u0AC7. \
\u0A86\u0AA8\u0ABE\u0AA5\u0AC0 \u0A97\u0ACB\u0AAA\u0AA8\u0AC0\u0AAF \u0AA1\u0AC7\u0A9F\u0ABE \u0A9C\u0ABE\u0AB9\u0AC7\u0AB0 \u0AA5\u0A88 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7, \u0AB8\u0ABF\u0AB8\u0ACD\u0A9F\u0AAE \u0AAC\u0A82\u0AA7 \u0AA5\u0A88 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7 (DoS), \u0A85\u0AA8\u0AC7 \u0AB8\u0AB0\u0ACD\u0AB5\u0AB0 \u0AB8\u0ABE\u0A87\u0AA1 \u0AB0\u0ABF\u0A95\u0ACD\u0AB5\u0AC7\u0AB8\u0ACD\u0A9F \u0AAB\u0ACB\u0AB0\u0ACD\u0A9C\u0AB0\u0AC0 \u0AA5\u0A88 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7.

#### Attack Vector Description
XXE_NO_VALIDATION=\u0AB0\u0ABF\u0A95\u0ACD\u0AB5\u0AC7\u0AB8\u0ACD\u0A9F \u0AAC\u0ACB\u0AA1\u0AC0\u0AAE\u0ABE\u0A82 \u0AAA\u0ABE\u0AB8 \u0A95\u0AB0\u0AC7\u0AB2\u0ABE XML \u0AAA\u0AB0 \u0A95\u0ACB\u0A88 \u0AB5\u0AC7\u0AB2\u0ABF\u0AA1\u0AC7\u0AB6\u0AA8 \u0AA8\u0AA5\u0AC0.
XXE_DISABLE_GENERAL_ENTITY=\u0AAA\u0ABE\u0AB0\u0ACD\u0AB8\u0AB0 \u0A9C\u0AA8\u0AB0\u0AB2 \u0A8F\u0A95\u0ACD\u0AB8\u0A9F\u0AB0\u0ACD\u0AA8\u0AB2 \u0A8F\u0AA8\u0ACD\u0A9F\u0ABF\u0A9F\u0AC0 \u0AAA\u0ACD\u0AB0\u0ACB\u0AB8\u0AC7\u0AB8 \u0A95\u0AB0\u0AB5\u0ABE \u0AAE\u0ABE\u0A9F\u0AC7 \u0A85\u0A95\u0ACD\u0AB7\u0AAE \u0A9B\u0AC7.
XXE_DISABLE_GENERAL_AND_PARAMETER_ENTITY=\u0AAA\u0ABE\u0AB0\u0ACD\u0AB8\u0AB0 \u0A9C\u0AA8\u0AB0\u0AB2 \u0A85\u0AA8\u0AC7 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0 \u0A8F\u0AA8\u0ACD\u0A9F\u0ABF\u0A9F\u0AC0 \u0AAA\u0ACD\u0AB0\u0ACB\u0AB8\u0AC7\u0AB8 \u0A95\u0AB0\u0AB5\u0ABE \u0AAE\u0ABE\u0A9F\u0AC7 \u0A85\u0A95\u0ACD\u0AB7\u0AAE \u0A9B\u0AC7.

# Path Traversal Attack
PATH_TRAVERSAL_VULNERABILITY=\u0AA1\u0ABF\u0AB0\u0AC7\u0A95\u0ACD\u0A9F\u0AB0\u0AC0 \u0A9F\u0ACD\u0AB0\u0ABE\u0AB5\u0AB0\u0ACD\u0AB8\u0AB2 (\u0A85\u0AA5\u0AB5\u0ABE \u0AAA\u0ABE\u0AA5 \u0A9F\u0ACD\u0AB0\u0ABE\u0AB5\u0AB0\u0ACD\u0AB8\u0AB2) \u0AB5\u0AAA\u0AB0\u0ABE\u0AB6\u0A95\u0AB0\u0ACD\u0AA4\u0ABE \u0AA6\u0ACD\u0AB5\u0ABE\u0AB0\u0ABE \u0A85\u0AAA\u0ABE\u0AAF\u0AC7\u0AB2\u0ABE \u0AAB\u0ABE\u0A88\u0AB2\u0AA8\u0ABE\u0AAE\u0ACB\u0AAE\u0ABE\u0A82 \u0A85\u0AAA\u0AC2\u0AB0\u0AA4\u0ABE \u0AB8\u0ABF\u0A95\u0ACD\u0AAF\u0AC1\u0AB0\u0ABF\u0A9F\u0AC0 \u0AB5\u0AC7\u0AB2\u0ABF\u0AA1\u0AC7\u0AB6\u0AA8\u0AA8\u0ACB \u0AB2\u0ABE\u0AAD \u0AB2\u0AC7 \u0A9B\u0AC7, \u0A9C\u0AC7\u0AA5\u0AC0 "\u0AAA\u0AC7\u0AB0\u0AA8\u0ACD\u0A9F \u0AA1\u0ABF\u0AB0\u0AC7\u0A95\u0ACD\u0A9F\u0AB0\u0AC0 \u0AAA\u0AB0 \u0A9C\u0ABE\u0A93" (..) \u0A9C\u0AC7\u0AB5\u0ABE \u0A95\u0AC7\u0AB0\u0AC7\u0A95\u0ACD\u0A9F\u0AB0\u0ACD\u0AB8 \u0AAB\u0ABE\u0A88\u0AB2 APIs \u0AAE\u0ABE\u0A82 \u0AAA\u0ABE\u0AB8 \u0AA5\u0A88 \u0A9C\u0ABE\u0AAF \u0A9B\u0AC7. \
\u0A86 \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0AA8\u0ACB \u0AA7\u0ACD\u0AAF\u0AC7\u0AAF \u0AAB\u0ABE\u0A88\u0AB2 \u0AB8\u0ABF\u0AB8\u0ACD\u0A9F\u0AAE \u0AAA\u0AB0 \u0A85\u0AA8\u0AA7\u0ABF\u0A95\u0AC3\u0AA4 \u0A8F\u0A95\u0ACD\u0AB8\u0AC7\u0AB8 \u0AAE\u0AC7\u0AB3\u0AB5\u0AB5\u0ABE\u0AA8\u0ACB \u0A9B\u0AC7.

#### AttackVector description
PATH_TRAVERSAL_URL_PARAM_DIRECTLY_INJECTED=\u0AAB\u0ABE\u0A88\u0AB2 \u0AB5\u0ABE\u0A82\u0A9A\u0AB5\u0ABE \u0AAE\u0ABE\u0A9F\u0AC7 \"fileName\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AB8\u0AC0\u0AA7\u0AC0 \u0AAA\u0ABE\u0AA5\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
PATH_TRAVERSAL_URL_PARAM_IF_DOT_DOT_PATH_NOT_PRESENT_DIRECTLY_INJECTED=\u0A9C\u0ACB \"fileName\" \u0AAE\u0ABE\u0A82 \"..\" \u0AA8 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \u0AA4\u0AC7\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
PATH_TRAVERSAL_URL_PARAM_IF_DOT_DOT_PATH_OR_%2F_NOT_PRESENT_DIRECTLY_INJECTED=\u0A9C\u0ACB \"fileName\" \u0AAE\u0ABE\u0A82 \"..\" \u0A85\u0AA5\u0AB5\u0ABE \"%2f\" \u0AA8 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \u0AA4\u0AC7\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.

# Command Injection Attack
COMMAND_INJECTION_VULNERABILITY=\u0A95\u0AAE\u0ABE\u0AA8\u0ACD\u0AA1 \u0A87\u0AA8\u0ACD\u0A9C\u0AC7\u0A95\u0ACD\u0AB6\u0AA8 \u0A8F \u0A8F\u0A95 \u0AB9\u0AC1\u0AAE\u0AB2\u0ACB \u0A9B\u0AC7 \u0A9C\u0AC7\u0AAE\u0ABE\u0A82 \u0AA8\u0AAC\u0AB3\u0AC0 \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8 \u0AA6\u0ACD\u0AB5\u0ABE\u0AB0\u0ABE \u0AB9\u0ACB\u0AB8\u0ACD\u0A9F \u0A93\u0AAA\u0AB0\u0AC7\u0A9F\u0ABF\u0A82\u0A97 \u0AB8\u0ABF\u0AB8\u0ACD\u0A9F\u0AAE \u0AAA\u0AB0 \u0AAE\u0AA8\u0AB8\u0ACD\u0AB5\u0AC0 \u0A95\u0AAE\u0ABE\u0AA8\u0ACD\u0AA1\u0ACD\u0AB8 \u0A8F\u0A95\u0ACD\u0A9D\u0ABF\u0A95\u0ACD\u0AAF\u0AC1\u0A9F \u0A95\u0AB0\u0AB5\u0ABE\u0AA8\u0ACB \u0AA7\u0ACD\u0AAF\u0AC7\u0AAF \u0AB9\u0ACB\u0AAF \u0A9B\u0AC7. \u0A86 \u0AA4\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0AB6\u0A95\u0ACD\u0AAF \u0AAC\u0AA8\u0AC7 \u0A9B\u0AC7 \u0A9C\u0ACD\u0AAF\u0ABE\u0AB0\u0AC7 \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8 \u0A85\u0AB8\u0AC1\u0AB0\u0A95\u0ACD\u0AB7\u0ABF\u0AA4 \u0AA1\u0AC7\u0A9F\u0ABE \u0AB8\u0ABF\u0AB8\u0ACD\u0A9F\u0AAE \u0AB6\u0AC7\u0AB2\u0AAE\u0ABE\u0A82 \u0AAA\u0ABE\u0AB8 \u0A95\u0AB0\u0AC7 \u0A9B\u0AC7.

#### Attack vectors
COMMAND_INJECTION_URL_PARAM_DIRECTLY_EXECUTED=\"ipaddress\" \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A8F\u0A95\u0ACD\u0A9D\u0ABF\u0A95\u0ACD\u0AAF\u0AC1\u0A9F \u0AA5\u0ABE\u0AAF \u0A9B\u0AC7.
COMMAND_INJECTION_URL_PARAM_DIRECTLY_EXECUTED_IF_SEMICOLON_SPACE_LOGICAL_AND_NOT_PRESENT=\u0A9C\u0ACB \";\", \"&\" \u0A85\u0AA5\u0AB5\u0ABE \u0AB8\u0ACD\u0AAA\u0AC7\u0AB8 \u0A95\u0AC7\u0AB0\u0AC7\u0A95\u0ACD\u0A9F\u0AB0\u0ACD\u0AB8 \u0AA8 \u0AB9\u0ACB\u0AAF \u0AA4\u0ACB \"ipaddress\" \u0AA8\u0AC0 \u0AB5\u0AC7\u0AB2\u0ACD\u0AAF\u0AC1 \u0AB8\u0AC0\u0AA7\u0AC0 \u0A8F\u0A95\u0ACD\u0A9D\u0ABF\u0A95\u0ACD\u0AAF\u0AC1\u0A9F \u0AA5\u0ABE\u0AAF \u0A9B\u0AC7.

# Remote File Injection
URL_BASED_RFI_INJECTION=URL \u0A86\u0AA7\u0ABE\u0AB0\u0ABF\u0AA4 \u0AB0\u0AC0\u0AAE\u0ACB\u0A9F \u0AAB\u0ABE\u0A88\u0AB2 \u0A87\u0AA8\u0ACD\u0A9C\u0AC7\u0A95\u0ACD\u0AB6\u0AA8 \u0AB9\u0AC1\u0AAE\u0AB2\u0ACB.

# JWT Injection
JWT_INJECTION_VULNERABILITY=JSON \u0AB5\u0AC7\u0AAC \u0A9F\u0ACB\u0A95\u0AA8 (JWT) \u0A8F \u0AAA\u0A95\u0ACD\u0AB7\u0ACB \u0AB5\u0A9A\u0ACD\u0A9A\u0AC7 \u0AB8\u0AC1\u0AB0\u0A95\u0ACD\u0AB7\u0ABF\u0AA4 \u0AB0\u0AC0\u0AA4\u0AC7 \u0AAE\u0ABE\u0AB9\u0ABF\u0AA4\u0AC0 \u0A9F\u0ACD\u0AB0\u0ABE\u0AA8\u0ACD\u0AB8\u0AAE\u0ABF\u0A9F \u0A95\u0AB0\u0AB5\u0ABE\u0AA8\u0AC0 \u0A8F\u0A95 \u0AB0\u0AC0\u0AA4 \u0A9B\u0AC7. JWT \u0AA8\u0ABE \u0A85\u0AAE\u0AB2\u0AC0\u0A95\u0AB0\u0AA3\u0AAE\u0ABE\u0A82 \u0A98\u0AA3\u0AC0 \u0AAD\u0AC2\u0AB2\u0ACB \u0AA5\u0A88 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7 \u0A9C\u0AC7 \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8\u0AA8\u0ABE \u0A93\u0AA5\u0AC7\u0AA8\u0ACD\u0A9F\u0ABF\u0A95\u0AC7\u0AB6\u0AA8 \u0A85\u0AA5\u0AB5\u0ABE \u0A93\u0AA5\u0ACB\u0AB0\u0ABE\u0A88\u0A9D\u0AC7\u0AB6\u0AA8\u0AA8\u0AC7 \u0A85\u0AB8\u0AB0 \u0A95\u0AB0\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7.

#### AttackVector description
JWT_URL_EXPOSING_SECURE_INFORMATION=\u0AB0\u0ABF\u0A95\u0ACD\u0AB5\u0AC7\u0AB8\u0ACD\u0A9F\u0AAE\u0ABE\u0A82 JWT \u0A9F\u0ACB\u0A95\u0AA8 \u0A9B\u0AC7 \u0A9C\u0AC7 URL \u0AAE\u0ABE\u0A82 \u0AB2\u0AC0\u0A95 \u0AA5\u0AAF\u0AC1\u0A82 \u0A9B\u0AC7. \u0A86 PCI \u0A85\u0AA8\u0AC7 \u0A85\u0AA8\u0ACD\u0AAF \u0AA8\u0AC0\u0AA4\u0ABF\u0A93\u0AA8\u0AC1\u0A82 \u0A89\u0AB2\u0ACD\u0AB2\u0A82\u0A98\u0AA8 \u0A95\u0AB0\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7.
COOKIE_CONTAINING_JWT_TOKEN_SECURITY_ATTRIBUTES_MISSING=\u0A95\u0AC2\u0A95\u0AC0 \u0A86\u0AA7\u0ABE\u0AB0\u0ABF\u0AA4 JWT \u0A9F\u0ACB\u0A95\u0AA8 \u0AAA\u0AB0\u0A82\u0AA4\u0AC1 Secure/HttpOnly \u0AAB\u0ACD\u0AB2\u0AC7\u0A97\u0ACD\u0AB8 \u0A85\u0AA8\u0AC7 \u0A95\u0AC2\u0A95\u0AC0 \u0AAA\u0ACD\u0AB0\u0ABF\u0AAB\u0ABF\u0A95\u0ACD\u0AB8 \u0AB5\u0A97\u0AB0.
COOKIE_BASED_LOW_KEY_STRENGTH_JWT_VULNERABILITY=\u0AA8\u0AAC\u0AB3\u0AC0 \u0A95\u0AC0 (Weak key) \u0AA5\u0AC0 \u0AB8\u0ABE\u0A87\u0AA8 \u0A95\u0AB0\u0AC7\u0AB2 \u0A95\u0AC2\u0A95\u0AC0 \u0A86\u0AA7\u0ABE\u0AB0\u0ABF\u0AA4 JWT \u0A9F\u0ACB\u0A95\u0AA8.
COOKIE_BASED_NONE_ALGORITHM_JWT_VULNERABILITY=\u0A95\u0AC2\u0A95\u0AC0 \u0A86\u0AA7\u0ABE\u0AB0\u0ABF\u0AA4 'None' \u0A85\u0AB2\u0ACD\u0A97\u0ACB\u0AB0\u0ABF\u0AA7\u0AAE\u0AA5\u0AC0 \u0AAA\u0ACD\u0AB0\u0AAD\u0ABE\u0AB5\u0ABF\u0AA4 JWT \u0A9F\u0ACB\u0A95\u0AA8 \u0AB5\u0AC7\u0AB2\u0ABF\u0AA1\u0AC7\u0A9F\u0AB0.

# SQL Injection Vulnerability
SQL_INJECTION_VULNERABILITY=SQL \u0A87\u0AA8\u0ACD\u0A9C\u0AC7\u0A95\u0ACD\u0AB6\u0AA8 \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0AAE\u0ABE\u0A82 \u0A95\u0ACD\u0AB2\u0ABE\u0AAF\u0A82\u0A9F \u0AAA\u0ABE\u0AB8\u0AC7\u0AA5\u0AC0 \u0A8F\u0AAA\u0ACD\u0AB2\u0ABF\u0A95\u0AC7\u0AB6\u0AA8\u0AA8\u0AC7 \u0A87\u0AA8\u0AAA\u0AC1\u0A9F \u0AA1\u0AC7\u0A9F\u0ABE \u0AA6\u0ACD\u0AB5\u0ABE\u0AB0\u0ABE SQL \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0A87\u0AA8\u0ACD\u0A9C\u0AC7\u0A95\u0ACD\u0A9F \u0A95\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7. \u0AB8\u0AAB\u0AB3 \u0AB9\u0AC1\u0AAE\u0AB2\u0ACB \u0AA1\u0AC7\u0A9F\u0ABE\u0AAC\u0AC7\u0A9D\u0AAE\u0ABE\u0A82\u0AA5\u0AC0 \u0AB8\u0A82\u0AB5\u0AC7\u0AA6\u0AA8\u0AB6\u0AC0\u0AB2 \u0AA1\u0AC7\u0A9F\u0ABE \u0AB5\u0ABE\u0A82\u0A9A\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7, \u0AA4\u0AC7\u0AA8\u0AC7 \u0AAC\u0AA6\u0AB2\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7 \u0A85\u0AA5\u0AB5\u0ABE \u0AA1\u0ABF\u0AB2\u0AC0\u0A9F \u0A95\u0AB0\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7.

#### AttackVector description
ERROR_SQL_INJECTION_URL_PARAM_APPENDED_DIRECTLY_TO_QUERY=\u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0 \u0AB8\u0AC0\u0AA7\u0ACB \u0A9C SQL \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7 \u0A9C\u0AC7\u0AA8\u0ABE \u0A95\u0ABE\u0AB0\u0AA3\u0AC7 \u0A8F\u0A95\u0ACD\u0AB8\u0AC7\u0AAA\u0ACD\u0AB6\u0AA8 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7 \u0A85\u0AA8\u0AC7 \u0AA1\u0AC7\u0A9F\u0ABE \u0A9C\u0ABE\u0AB9\u0AC7\u0AB0 \u0AA5\u0ABE\u0AAF \u0A9B\u0AC7.
ERROR_SQL_INJECTION_URL_PARAM_WRAPPED_WITH_SINGLE_QUOTE_APPENDED_TO_QUERY=\u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0\u0AA8\u0AC7 Single Quote (') \u0AAE\u0ABE\u0A82 \u0AB2\u0AAA\u0AC7\u0A9F\u0AC0\u0AA8\u0AC7 SQL \u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0\u0AAE\u0ABE\u0A82 \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7.
UNION_SQL_INJECTION_URL_PARAM_APPENDED_DIRECTLY_TO_QUERY=\u0A95\u0ACD\u0AB5\u0AC7\u0AB0\u0AC0 \u0AAA\u0AC7\u0AB0\u0ABE\u0AAE\u0AC0\u0A9F\u0AB0 \u0AB8\u0AC0\u0AA7\u0ACB \u0A89\u0AAE\u0AC7\u0AB0\u0AB5\u0ABE\u0AAE\u0ABE\u0A82 \u0A86\u0AB5\u0AC7 \u0A9B\u0AC7 \u0A9C\u0AC7\u0AA5\u0AC0 \"Union\" \u0A95\u0AC0\u0AB5\u0AB0\u0ACD\u0AA1\u0AA8\u0ACB \u0A89\u0AAA\u0AAF\u0ACB\u0A97 \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 \u0AA1\u0AC7\u0A9F\u0ABE \u0AAE\u0AC7\u0AB3\u0AB5\u0AC0 \u0AB6\u0A95\u0ABE\u0AAF.

#### SSRF Vulnerability
SSRF_VULNERABILITY=\u0AB8\u0AB0\u0ACD\u0AB5\u0AB0-\u0AB8\u0ABE\u0A87\u0AA1 \u0AB0\u0ABF\u0A95\u0ACD\u0AB5\u0AC7\u0AB8\u0ACD\u0A9F \u0AAB\u0ACB\u0AB0\u0ACD\u0A9C\u0AB0\u0AC0 (SSRF) \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0AAE\u0ABE\u0A82, \u0AB9\u0AC1\u0AAE\u0AB2\u0ABE\u0A96\u0ACB\u0AB0 \u0AB8\u0AB0\u0ACD\u0AB5\u0AB0 \u0AAA\u0AB0\u0AA8\u0ABE \u0AAB\u0A82\u0A95\u0ACD\u0AB6\u0AA8\u0AA8\u0ACB \u0A89\u0AAA\u0AAF\u0ACB\u0A97 \u0A95\u0AB0\u0AC0\u0AA8\u0AC7 \u0A86\u0A82\u0AA4\u0AB0\u0ABF\u0A95 \u0AB8\u0A82\u0AB8\u0ABE\u0AA7\u0AA8\u0ACB \u0AB5\u0ABE\u0A82\u0A9A\u0AC0 \u0A85\u0AA5\u0AB5\u0ABE \u0A85\u0AAA\u0AA1\u0AC7\u0A9F \u0A95\u0AB0\u0AC0 \u0AB6\u0A95\u0AC7 \u0A9B\u0AC7.
SSRF_VULNERABILITY_URL_WITHOUT_CHECK=\u0A86\u0AAA\u0AC7\u0AB2 URL \u0AAA\u0AB0 \u0A95\u0ACB\u0A88 \u0AB5\u0AC7\u0AB2\u0ABF\u0AA1\u0AC7\u0AB6\u0AA8 \u0AA8\u0AA5\u0AC0.
SSRF_VULNERABILITY_URL_IF_NOT_FILE_PROTOCOL=\u0A86\u0AAA\u0AC7\u0AB2 URL \u0AAE\u0ABE\u0A9F\u0AC7 file:// \u0AAA\u0ACD\u0AB0\u0ACB\u0A9F\u0ACB\u0A95\u0ACB\u0AB2\u0AA8\u0AC0 \u0AAE\u0A82\u0A9C\u0AC2\u0AB0\u0AC0 \u0AA8\u0AA5\u0AC0.
SSRF_VULNERABILITY_URL_ONLY_IF_IN_THE_WHITELIST=\u0AAE\u0ABE\u0AA4\u0ACD\u0AB0 \u0AB5\u0ACD\u0AB9\u0ABE\u0A87\u0A9F\u0AB2\u0ABF\u0AB8\u0ACD\u0A9F \u0A95\u0AB0\u0AC7\u0AB2\u0ABE URL \u0AA8\u0AC0 \u0AAE\u0A82\u0A9C\u0AC2\u0AB0\u0AC0 \u0A9B\u0AC7.

# JWT Injection Header
HEADER_INJECTION_VULNERABILITY=\u0AA4\u0AC7 \u0AAA\u0AB0\u0AC0\u0A95\u0ACD\u0AB7\u0AA3 \u0A95\u0AB0\u0AC7 \u0A9B\u0AC7 \u0A95\u0AC7 \u0AB8\u0ABF\u0A97\u0ACD\u0AA8\u0AC7\u0A9A\u0AB0 \u0AB5\u0AC7\u0AB0\u0ABF\u0AAB\u0ABF\u0A95\u0AC7\u0AB6\u0AA8 \u0AAC\u0AA6\u0AB2\u0AB5\u0ABE \u0AAE\u0ABE\u0A9F\u0AC7 JWT \u0AB9\u0AC7\u0AA1\u0AB0\u0AAE\u0ABE\u0A82 \u0A95\u0AC7\u0AB5\u0AC0 \u0AB0\u0AC0\u0AA4\u0AC7 \u0AB9\u0AC7\u0AB0\u0ABE\u0AAB\u0AC7\u0AB0\u0AC0 \u0A95\u0AB0\u0AC0 \u0AB6\u0A95\u0ABE\u0AAF \u0A9B\u0AC7.